logs_pics/wrkLogsGet.txt
Running 5s test @ http://localhost:8080/v0/status
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93ms  465.29us   5.50ms   63.45%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.92ms
 75.000%    1.26ms
 90.000%    1.57ms
 99.000%    1.84ms
 99.900%    2.08ms
 99.990%    5.12ms
 99.999%    5.50ms
100.000%    5.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.016     0.000000            2         1.00
       0.272     0.100000         1006         1.11
       0.495     0.200000         2000         1.25
       0.685     0.300000         3009         1.43
       0.811     0.400000         4003         1.67
       0.924     0.500000         5005         2.00
       0.979     0.550000         5506         2.22
       1.030     0.600000         6008         2.50
       1.091     0.650000         6502         2.86
       1.155     0.700000         7003         3.33
       1.256     0.750000         7502         4.00
       1.306     0.775000         7749         4.44
       1.359     0.800000         8004         5.00
       1.407     0.825000         8254         5.71
       1.455     0.850000         8499         6.67
       1.509     0.875000         8751         8.00
       1.536     0.887500         8879         8.89
       1.571     0.900000         9000        10.00
       1.601     0.912500         9126        11.43
       1.631     0.925000         9252        13.33
       1.657     0.937500         9373        16.00
       1.670     0.943750         9436        17.78
       1.685     0.950000         9500        20.00
       1.702     0.956250         9563        22.86
       1.719     0.962500         9625        26.67
       1.735     0.968750         9685        32.00
       1.745     0.971875         9724        35.56
       1.755     0.975000         9748        40.00
       1.766     0.978125         9780        45.71
       1.784     0.981250         9812        53.33
       1.798     0.984375         9842        64.00
       1.805     0.985938         9859        71.11
       1.813     0.987500         9873        80.00
       1.829     0.989062         9888        91.43
       1.841     0.990625         9904       106.67
       1.852     0.992188         9919       128.00
       1.860     0.992969         9927       142.22
       1.868     0.993750         9936       160.00
       1.871     0.994531         9943       182.86
       1.881     0.995313         9955       213.33
       1.886     0.996094         9959       256.00
       1.892     0.996484         9962       284.44
       1.900     0.996875         9966       320.00
       1.906     0.997266         9970       365.71
       1.913     0.997656         9974       426.67
       1.933     0.998047         9978       512.00
       1.941     0.998242         9980       568.89
       1.951     0.998437         9982       640.00
       1.965     0.998633         9984       731.43
       2.034     0.998828         9986       853.33
       2.105     0.999023         9988      1024.00
       2.127     0.999121         9989      1137.78
       2.451     0.999219         9990      1280.00
       2.937     0.999316         9991      1462.86
       3.421     0.999414         9992      1706.67
       3.903     0.999512         9993      2048.00
       3.903     0.999561         9993      2275.56
       4.379     0.999609         9994      2560.00
       4.379     0.999658         9994      2925.71
       4.751     0.999707         9995      3413.33
       4.751     0.999756         9995      4096.00
       4.751     0.999780         9995      4551.11
       5.123     0.999805         9996      5120.00
       5.123     0.999829         9996      5851.43
       5.123     0.999854         9996      6826.67
       5.123     0.999878         9996      8192.00
       5.123     0.999890         9996      9102.22
       5.503     0.999902         9997     10240.00
       5.503     1.000000         9997          inf
#[Mean    =        0.925, StdDeviation   =        0.465]
#[Max     =        5.500, Total count    =         9997]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   65.00us
 75.000%   86.00us
 90.000%  117.00us
 99.000%  148.00us
 99.900%  221.00us
 99.990%  377.00us
 99.999%    4.68ms
100.000%    4.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.013     0.000000           21         1.00
       0.020     0.100000         1277         1.11
       0.023     0.200000         2375         1.25
       0.027     0.300000         3053         1.43
       0.060     0.400000         4010         1.67
       0.065     0.500000         5159         2.00
       0.068     0.550000         5621         2.22
       0.074     0.600000         6015         2.50
       0.081     0.650000         6614         2.86
       0.083     0.700000         7229         3.33
       0.086     0.750000         7544         4.00
       0.091     0.775000         7750         4.44
       0.103     0.800000         8009         5.00
       0.107     0.825000         8400         5.71
       0.108     0.850000         8608         6.67
       0.110     0.875000         8818         8.00
       0.112     0.887500         8886         8.89
       0.117     0.900000         9007        10.00
       0.124     0.912500         9143        11.43
       0.125     0.925000         9406        13.33
       0.125     0.937500         9406        16.00
       0.126     0.943750         9523        17.78
       0.126     0.950000         9523        20.00
       0.127     0.956250         9597        22.86
       0.128     0.962500         9638        26.67
       0.130     0.968750         9706        32.00
       0.131     0.971875         9762        35.56
       0.131     0.975000         9762        40.00
       0.132     0.978125         9803        45.71
       0.133     0.981250         9823        53.33
       0.135     0.984375         9842        64.00
       0.139     0.985938         9857        71.11
       0.144     0.987500         9876        80.00
       0.148     0.989062         9898        91.43
       0.149     0.990625         9911       106.67
       0.151     0.992188         9920       128.00
       0.155     0.992969         9933       142.22
       0.157     0.993750         9935       160.00
       0.165     0.994531         9943       182.86
       0.173     0.995313         9951       213.33
       0.191     0.996094         9958       256.00
       0.195     0.996484         9964       284.44
       0.197     0.996875         9966       320.00
       0.201     0.997266         9970       365.71
       0.207     0.997656         9976       426.67
       0.208     0.998047         9981       512.00
       0.208     0.998242         9981       568.89
       0.209     0.998437         9984       640.00
       0.209     0.998633         9984       731.43
       0.216     0.998828         9986       853.33
       0.221     0.999023         9989      1024.00
       0.221     0.999121         9989      1137.78
       0.222     0.999219         9991      1280.00
       0.222     0.999316         9991      1462.86
       0.225     0.999414         9992      1706.67
       0.231     0.999512         9993      2048.00
       0.231     0.999561         9993      2275.56
       0.239     0.999609         9994      2560.00
       0.239     0.999658         9994      2925.71
       0.277     0.999707         9995      3413.33
       0.277     0.999756         9995      4096.00
       0.277     0.999780         9995      4551.11
       0.377     0.999805         9996      5120.00
       0.377     0.999829         9996      5851.43
       0.377     0.999854         9996      6826.67
       0.377     0.999878         9996      8192.00
       0.377     0.999890         9996      9102.22
       4.683     0.999902         9997     10240.00
       4.683     1.000000         9997          inf
#[Mean    =        0.065, StdDeviation   =        0.060]
#[Max     =        4.680, Total count    =         9997]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9998 requests in 5.00s, 605.35KB read
Requests/sec:   1999.66
Transfer/sec:    121.07KB